Tekla.Structures.DrawingInternal.EventHandler
EventHandler is a class that TS calls when an event is raised. Handler
then calls all the listener "Events" objects.

Tekla.Structures.DrawingInternal.EventHandler.AddListener(Tekla.Structures.Drawing.UI.IUIEvents)


Tekla.Structures.DrawingInternal.EventHandler.AddListener(Tekla.Structures.Drawing.IEvents)


Tekla.Structures.DrawingInternal.EventHandler.RemoveListener(Tekla.Structures.Drawing.UI.IUIEvents)


Tekla.Structures.DrawingInternal.EventHandler.RemoveListener(Tekla.Structures.Drawing.IEvents)


Tekla.Structures.DrawingInternal.EventHandler.OnEvent(System.String)
TS calls when event is raised.
Param: Name of the event
Returns: 1

Tekla.Structures.DrawingInternal.EventHandler.TimerSelectionChangedTick(System.Object,System.EventArgs)
Gets invoked if slection changed interval smaller than 100 msecs

Tekla.Structures.DrawingInternal.EventHandler.GetChangedDrawing
Gets changed drawing from model database

Tekla.Structures.DrawingInternal.EventHandler.GetDrawingReadyForIssuingEvent
Gets the DrawingReadyForIssuing event parameters.
Returns: the guid of the drawing, and whether it was marked ready for issuing